In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   gender  3 non-null      object
 2   score   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [5]:
df.describe(include='all')

           name gender    score
count         5      3   4.0000
unique        5      2      NaN
top     Jessica      F      NaN
freq          1      2      NaN
mean        NaN    NaN  88.0000
std         NaN    NaN   9.0185
min         NaN    NaN  75.0000
25%         NaN    NaN  85.5000
50%         NaN    NaN  91.0000
75%         NaN    NaN  93.5000
max         NaN    NaN  95.0000

In [6]:
df['gender'].value_counts()

gender
F    2
M    1
Name: count, dtype: int64

In [ ]:
print(pd.isna(df))
print(type(pd.isna(df)))
pd.isna(df).sum() # 컬럼별 True 갯수

    name  gender  score
0  False   False  False
1  False    True  False
2  False    True  False
3  False   False   True
4  False   False  False
<class 'pandas.core.frame.DataFrame'>

name      0
gender    2
score     1
dtype: int64

In [13]:
clean_df = df.dropna()
print(clean_df)
print(df)

      name gender  score
0  Jessica      F   89.0
4     Alex      F   93.0
      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [14]:
c_df = df.dropna(subset=['name', 'score'])
c_df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [20]:
# df1 = df.fillna(0)
df1 = df.fillna({'gender' : 'etc', 'score' : df['score'].mean()})
df1

      name gender  score
0  Jessica      F   89.0
1     Liam    etc   75.0
2   Sophia    etc   95.0
3     Ryan      M   88.0
4     Alex      F   93.0

In [21]:
df1['gender'].value_counts()

gender
F      2
etc    2
M      1
Name: count, dtype: int64